[{"title":"Getting Started With SignalR","description":"This article picks up from the author's previous post: Real-time SignalR and Angular 2 dashboardI had a couple of questions from someone who forked the project on GitHub and is using it as the basis for their own custom dashboard, which reminded me that there are a few key things I picked up on my learning journey that I should share. These are primarily focused around SignalR aspects.","link":"https://dzone.com/articles/getting-started-with-signalr-1?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["server-side","new","asp.net mvc","custom","real-time","singleton","instance"],"date":"Sat, 15 Oct 2016 04:31:07 GMT"},{"title":"Installing Oracle JET for JavaScript Web Development","description":"One of the fun parts of my job as a mobile and development tools product manager, is I'm often given the chance to learn new technologies, without necessarily the pressure of rushing to deliver a project and therefore also rushing learning the technology superficially.Up until&nbsp;recently, I've had the chance to focus on Android, iOS, and NodeJS thanks to Oracle Mobile Cloud Service&nbsp;and its various SDKs for each platform. But finally, a little late given how popular it has been since public release in 2015, I've finally had a chance to kick the, ah, wings of Oracle's JavaScript Extension Toolkit, commonly known as Oracle JET.","link":"https://dzone.com/articles/installing-oracle-jet-for-javascript-web-developme?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["javascript","tutorial","web development","cordova","grunt","install","bower","requirejs","yeoman","knockout"],"date":"Sat, 15 Oct 2016 04:01:12 GMT"},{"title":"Tips and Tricks for Debugging Client-side JavaScript","description":"Debugging client-side JavaScript can be a frustrating experience. The environment in which your code is running means a large number of things could go wrong. Race conditions, browser feature compatibility, dependency issues and resources failing to download – can seem outside of your control.These issues can be handled by reducing the number of points of failure and simplifying how assets are loaded. Another main source of frustration can come from the language of JavaScript itself. Relying on the language to enforce good practices or even consistent syntax (like many other modern languages now do) simply doesn’t work.","link":"https://dzone.com/articles/tips-and-tricks-for-debugging-client-side-javascri?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["javascript","web dev","debugging","raygun"],"date":"Fri, 14 Oct 2016 16:29:25 GMT"},{"title":"What's Used Most Frequently To Build Web Applications?","description":"To gather insights on the state of web application development today, we spoke to 13 executives from 12 companies developing web applications or providing web application development tools to their clients.Specifically, we spoke to:","link":"https://dzone.com/articles/whats-used-most-frequently-to-build-web-applicatio?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["javascript","html5","angularjs","node.js","web dev"],"date":"Fri, 14 Oct 2016 06:01:04 GMT"},{"title":"Exploring A Top-Down SOAP Service: Part VI","description":"We Take Things Up Where We Left Off...In Part V, we created our new SOAP response type for the single operation that we have so far in our web service, and we did so using a Composition approach.We began with an XSD / WSDL, generated the code , merged it into what we already had, built, deployed, and tested it.","link":"https://dzone.com/articles/exploring-a-top-down-soap-service-part-6?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["java","web dev","soap","wsdl","xsd"],"date":"Fri, 14 Oct 2016 05:01:00 GMT"},{"title":"Bootstrap 3.3 Extend Grid System (LESS)","description":"Did you know that adding XL breakpoint to grid system without touching source code of Bootstrap is possible? Import grid.less-, define some variables, and create one mixin. Let’s dive in.In almost all cases, xs, sm, md, and lg sizes are enough for the application. You just need to investigate, design, and plan what breakpoints size we need — lg will be the largest one. But unexpected situations happens and some elements can be in need of a grid that adapts to larger screens.","link":"https://dzone.com/articles/bootstrap-33-extend-grid-system-less?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["web dev","bootstrap 3","less","soft skills training"],"date":"Fri, 14 Oct 2016 04:31:07 GMT"},{"title":"OCI and DZone Present Grails Quickcast #6: Developing Grails 3 Applications With IntelliJ IDEA","description":"DZone and OCI are proud to present the sixth Grails QuickCast:&nbsp;Developing Grails 3 Applications With IntelliJ IDEA. Grails co-founder, Jeff Scott Brown, introduces several tips and tricks related to building Grails 3 applications in IDEA.&nbsp;Grails 3 is a super high productivity framework for building web applications for the JVM. IntelliJ IDEA is a super high productivity Integrated Development Environment (IDE) for building a variety of types of applications. IDEA has always had really great support for building Grails applications, and in particular, has the very best support of any IDE for doing development with Grails 3.","link":"https://dzone.com/articles/oci-and-dzone-present-grails-quickcast-6-developin?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["web dev","jvm","grails","intellij"],"date":"Fri, 14 Oct 2016 04:16:00 GMT"},{"title":"The Last Rails I18n Guide You’ll Ever Need: Part II","description":"Here is the second half of Ilya Bodrov's guide for Rails I18n. Did you miss Part I? Read it here!Translations for ActiveRecordSo now suppose we wish to manage blog posts using our application. Create a scaffold and apply the corresponding migration:","link":"https://dzone.com/articles/the-last-rails-i18n-guide-youll-ever-need-part-ii?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["ruby","web dev","translation","i18n","rails tutorial"],"date":"Fri, 14 Oct 2016 04:01:00 GMT"},{"title":"Issues Affecting Development of Web Apps","description":"To gather insights on the state of web application development today, we spoke to 13 executives from 12 companies developing web applications or providing web application development tools to their clients.Specifically, we spoke to:","link":"https://dzone.com/articles/issues-affecting-development-of-web-apps?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["web dev","javascript frameworks","integration with legacy systems"],"date":"Thu, 13 Oct 2016 06:01:00 GMT"},{"title":"Designing Applications for Failure","description":"I recently had the opportunity to attend an AWS bootcamp Herndon, VA office and a short presentation given by their team on Designing for Failure. It opened my eyes to the reality of application design when dealing with failure or even basic exception handling.One of the defining characteristics between a good developer and a great one is how they deal with failures. Good developers will handle the obvious examples in their code – checking for unexpected input, catching library exceptions, and sometimes edge cases. Why do we build resilient applications and what about the end user?","link":"https://dzone.com/articles/designing-applications-fornbspfailure?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["web dev","applications","failure","resilience"],"date":"Thu, 13 Oct 2016 05:31:08 GMT"},{"title":"How to Create a Diff of an Image in Python","description":"For the past couple of years, I’ve been writing automated tests for my employer. One of the many types of tests that I do is comparing how an application draws. Does it draw the same way every single time? If not, then we have a serious problem. An easy way to check that it draws the same each time is to take a screenshot and then compare it to future versions of the same drawing when the application gets updated.The Pillow library provides a handy tool for this sort of thing that is called ImageChops. If you don’t already have Pillow, you should go install it now so you can follow along with this short tutorial.","link":"https://dzone.com/articles/how-to-create-a-diff-of-an-image-in-python?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["python","image","python 2.7"],"date":"Thu, 13 Oct 2016 05:31:04 GMT"},{"title":"Exploring A Top-Down SOAP Service: Part V","description":"Last Time...In Part IV, we explored and expanded on WSDLs, XSDs, multiple namespaces. &nbsp;All of that was in preparation for today's steps.At the moment, our top-down SOAP service has a single operation. &nbsp;We want to create a new response type for it, that will meet the requirements set out at the start&nbsp;when we were approached to create a service for the Shape Calculator (make-believe story).","link":"https://dzone.com/articles/exploring-a-top-down-soap-service-part-5?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["java","web dev","soap","schema","wsdl","xsd"],"date":"Thu, 13 Oct 2016 05:01:04 GMT"},{"title":"Getting Started with Laravel: Part I","description":"Laravel is one of the most popular, if not THE most popular PHP framework and after using Laravel and comparing it with the likes of Zend and Symfony it's easy to see why&nbsp;over the courses of multiple tutorials we're going to go over some of the best features of Laravel.Laravel has so many features and helpful classes that you can quickly and easily build any application or API with Laravel.","link":"https://dzone.com/articles/getting-started-with-laravel-1?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["php","tutorial","web dev","application","laravel"],"date":"Thu, 13 Oct 2016 04:31:07 GMT"},{"title":"The Last Rails I18n Guide You’ll Ever Need: Part I","description":"Internationalization (dubbed as I18n as there are exactly eighteen characters between the first \"I\" and the last \"n\") means creating an application that can be adapted to various languages easily, without the need to do complex changes. This involves extracting various bits (like strings, date and currency formats) out of an application and then providing translations and formats for them. The latter is called localization and sometimes is dubbed as L10n. If your company is growing and seeking to go international, localization is an important step to do.In this article, we will discuss how to add support for I18n in a Rails application, where to store translations, what localized views are, how to format dates and times, how to introduce pluralization rules and more. By the end of this article you will have a solid understanding of using I18n with Rails and be ready to employ the described techniques when building the real-world apps.","link":"https://dzone.com/articles/the-last-rails-i18n-guide-youll-ever-need-1?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["ruby","web dev","translation","i18n","rails tutorial"],"date":"Thu, 13 Oct 2016 04:01:00 GMT"},{"title":"Problems Being Solved With Web Apps","description":"To gather insights on the state of web application development today, we spoke to 13 executives from 12 companies developing web applications or providing web application development tools to their clients.Specifically, we spoke to:","link":"https://dzone.com/articles/problems-being-solved-with-web-apps?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["continuous integration","web application development","web apps","web 3.0"],"date":"Wed, 12 Oct 2016 06:01:08 GMT"},{"title":"Top 12 Challenges of Web Application Testing","description":"Why do you need to perform Web Application Testing?Let’s have a look at what challenges your web app can face, if testing is not taken care of.","link":"https://dzone.com/articles/top-12-challenges-of-web-application-testing-the-d?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["digital marketing","test automation","automated testing","quality assurance","performance testing","digital marketing agency","testing tools","search engine optimization","web application development","web testing"],"date":"Wed, 12 Oct 2016 05:31:04 GMT"},{"title":"7 Top JavaScript Frameworks List in 2016","description":"When it comes to Web Development, JavaScript frameworks are some of the most favored platforms for developers and businesses. Possibly, you have had a chance to experiment with one or two of the top JavaScript Frameworks, but you are still a little unsure about the best one to devote yourself to mastering, or which one to suggest your developer opt for your next web development project.JavaScript is moving at a breakneck pace and there is constant pressure to add &nbsp;new skills to your repository. In order to do that, knowing and understanding more of the top JavaScript Frameworks in today’s time is necessary. After a thorough research at ValueCoders, we shortlisted seven of them and here they are:","link":"https://dzone.com/articles/top-javascript-frameworks-list-in-2016?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["frameworks","development","app","release","project","js","interactive","high"],"date":"Wed, 12 Oct 2016 05:01:07 GMT"},{"title":"3 Essential Tips for Refactoring CSS Without Losing Your Mind","description":"Working with legacy code can be tremendously cumbersome for even the most seasoned web developer.From eye-straining syntax&nbsp;to performance issues on a global scale, unruly code can be one of the biggest pain points you can encounter when working on a new client’s website. Luckily, refactoring offers an option for escaping the abyss of jumbled code.","link":"https://dzone.com/articles/3-essential-tips-for-refactoring-css-without-losin?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["web","refactoring","code","process","project","series","partners","points"],"date":"Wed, 12 Oct 2016 04:31:08 GMT"},{"title":"Exploring A Top-Down SOAP Service: Part IV","description":"Last time...When we left off in Part III, we had a basic web service running with one simple operation that can return an integer (of how many calculations were performed). It will also return a SOAP fault if there is an exception (such as the database not available).Latest CodeYou can get the latest code for the web service here. And for our dependency on our child (Shape Calculator project), here. And if you want to read all of the chronological articles that have led us to this one, you can go here.","link":"https://dzone.com/articles/exploring-a-top-down-soap-service-part-4?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["web services","java 8","soap","j2ee","schema","cxf","wsdl","xsd","namespaces","wsdl2java"],"date":"Wed, 12 Oct 2016 04:01:00 GMT"},{"title":"Most Significant Changes To Web Application Development","description":"To gather insights on the state of web application development today, we spoke to 13 executives from 12 companies developing web applications or providing web application development tools to their clients.Specifically, we spoke to:","link":"https://dzone.com/articles/most-significant-changes-to-web-application-develo?utm_medium=feed&utm_source=feedpress.me&utm_campaign=Feed%3A+dzone%2Fwebdev\n      ","source":"DZone","channel":"dzone","tags":["frameworks","continuous integration","apis","web applications","applications developers","build systems","support standards"],"date":"Tue, 11 Oct 2016 06:02:00 GMT"}]