[{"title":"Chasing Tools →","description":"Tim Kadlec:\n\nHave you ever watched someone who has been using Vim for years work in it? It’s amazing! Some joke that the reason they’re still in there is because they haven’t learned how to quit yet, but I think they’re onto something. While some of us jump from tool to new tool year after year, they continue to master this “boring” tool that just works—getting more and more efficient as time goes on.","link":"https://timkadlec.com/2016/10/chasing-tools/","source":"martinwolf","channel":"martinwolf","tags":"","date":"Oct 10, 2016"},{"title":"Jonathan Snook: Running into Windows →","description":"After #davegoeswindows we now have #snookgoeswindows. It will be very interesting to follow along Jonathans journey and to see if he will stick with Windows like Dave Rupert did. In this first post Jonathan shares his initial impressions, but he hasn't set up his dev environment yet, which will be especially interesting.","link":"https://snook.ca/archives/other/running-into-windows","source":"martinwolf","channel":"martinwolf","tags":"","date":"Oct 04, 2016"},{"title":"I don't care about accessibility →","description":"Dave Rupert:\n\nThe beauty of the Web is in simplicity. Simple solutions are easier to implement, maintain, serve, render, improve, and access.\n\nLast week Dave dug up a few great old blog posts and commented on them. This is about one from Jeffrey Veen from 2004.\nThis quote from Dave especially resonated with me and was stuck in my mind so I wanted to share it and it's accompanying post with you.","link":"http://daverupert.com/2016/09/i-don-t-care-about-accessibility/","source":"martinwolf","channel":"martinwolf","tags":"","date":"Oct 03, 2016"},{"title":"Google: 53% of mobile users abandon sites that take longer than 3 seconds to load →","description":"Tammy Everts summarizing some key facts from the web performance research done by Google:\n\nAverage load time for mobile sites is 19 seconds over 3G .\n\nHoly Shit.","link":"https://www.soasta.com/blog/google-mobile-web-performance-study/","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 26, 2016"},{"title":"Variable fonts →","description":"Tim Brown:\n\nJust minutes ago, at the ATypI conference in Warsaw, the world was introduced to a new kind of font: a variable font. Jointly developed by Apple, Google, Microsoft, and Adobe, a variable font is, as John Hudson put it, “a single font file that behaves like multiple fonts”. Imagine a single font file gaining an infinite flexibility of weight, width, and other attributes without also gaining file size — and imagine what this means for design.\n\nMind blown. As with all new cool things on the web, it will be a long path until we can actually use these variable fonts on the web. But it will be a awesome for sure: Imagine beautiful typography combined with fast page loads.","link":"http://blog.typekit.com/2016/09/14/variable-fonts-a-new-kind-of-font-for-flexible-design/","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 24, 2016"},{"title":"Typography is impossible →","description":"Marcin Wichary:\n\nYou’re a front-end engineer… but at this very moment, you’re also a typesetter. It’s good work. Satisfying work. [...] But you’re about to discover, or perhaps already discovered, that this is no smooth sailing. Setting type can be tricky. Type lets you get close, but it never quite does what you want it to do.\n\nAnother great post covering typography on the web by Marcin. This time about laying out type. Why is it behaving the way it does, what you need to bear in mind when working with type on the web and more. I bet there's something new for everyone of you in there.","link":"https://medium.engineering/typography-is-impossible-5872b0c7f891#.otjze1owg","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 22, 2016"},{"title":"Safari 10.0 →","description":"Safari 10 is here and brings a bunch of new features which makes us web developers happy, for example:\n\nWOFF 2.0 Support\nSupport of CSS Font Loading Module Level 3 (Remember how CSS Levels work?)\nCSS Support for object-position","link":"https://developer.apple.com/library/content/releasenotes/General/WhatsNewInSafari/Articles/Safari_10_0.html","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 21, 2016"},{"title":"Why there is no CSS4 →","description":"Rachel Andrew explaining CSS Levels:\n\nIf you read something about CSS3 Selectors, then what is actually being described is something that is part of the CSS Selectors Level 3 specification. In fact CSS Selectors is one of the specifications that is marked as completed and a Recommendation. The CSS Working Group is now working on Selectors Level 4 with new proposed features plus the selectors that were part of Level 3 (and CSS 1 and 2). It’s not CSS4, but Level 4 of a single specification. One small part of CSS.\n\nIn the comments of the article Šime Vidas posted a link where \"you can check which modules have multiple levels and which one is “Current Work”.\" Very useful.","link":"https://www.rachelandrew.co.uk/archives/2016/09/13/why-there-is-no-css4-explaining-css-levels/","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 19, 2016"},{"title":"Bereiche mit nth-child selektieren","description":"Hey! In diesem Video zeige ich euch einen weiteren coolen nth-child Trick. Es geht darum wie man nth-child verschiedene Bereiche selektieren kann. Also zum Beispiel von Kind-Element 5 aufwärts. Oder von 5 bis 10, oder oder oder.\nCodePen:\nhttp://codepen.io/martinwolf/pen/jrqrgb/","link":"https://martinwolf.org/blog/2016/09/bereiche-mit-nth-child-selektieren","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 19, 2016"},{"title":"flex-grow und flex-shrink","description":"Hey! Heute zeige ich euch wie man Elemente mit Flexbox ganz einfach gleichmäßig verteilen kann ohne einen verrückten nth-last-child Trick nutzen zu müssen.\nCodePen:\nhttp://codepen.io/martinwolf/pen/xEGqKP/\nDies ist ein Follow Up zum vorherigen Video.","link":"https://martinwolf.org/blog/2016/09/flex-grow-und-flex-shrink","source":"martinwolf","channel":"martinwolf","tags":"","date":"Sep 19, 2016"}]